{
    "picture": "https://avatars.githubusercontent.com/u/110633725",
    "linkedin": "https://www.linkedin.com/in/david-santana-067278288/",
    "github": "https://github.com/davidsantana06",
    "email": "davidsantana06@hotmail.com",
    "greeting": "Hi, i'm David Santana!",
    "presentation": "I'm a technology enthusiast, focused on bringing proactivity, innovation, and organization to the work environment. My main skills include building web applications, APIs, databases, artificial intelligence, WebSockets, task automation, and data analysis.",
    "formation": {
        "course": "Bachelor's degree in Information Systems",
        "learningCenter": "Federal Institute of Education, Science, and Technology of Bahia",
        "startDate": "05/2021",
        "endDate": "Currently"
    },
    "professionalExperiences": [
        {
            "position": "Academic Monitor",
            "company": "Federal Institute of Education, Science, and Technology of Bahia",
            "responsibilities": "Academic activity in which I instructed students from the Information Systems course on important concepts of the Java programming language, such as exceptions, threads, generics, collections, I/O, and JavaFX. Additionally, I was responsible for addressing specific doubts related to the development of activities, academic papers, and exams.",
            "startDate": "09/2022",
            "endDate": "12/2022"
        },
        {
            "position": "Web Developer",
            "company": "Municipal Health Department of Vitória da Conquista",
            "responsibilities": "Internship focused on web applications development, encompassing requirements analysis, data collection, documentation, prototyping, development, and deployment. I primarily used the Python programming language with the Flask framework, alongside JavaScript, HTML, CSS, and Bootstrap.",
            "startDate": "02/2023",
            "endDate": "02/2024"
        },
        {
            "position": "Data Engineer",
            "company": "Compass UOL",
            "responsibilities": "Training path focused on cloud computing, covering Python and SQL languages, cloud computing components, analytical and processing services, as well as techniques and tools for data visualization and modeling.",
            "startDate": "04/2024",
            "endDate": "Currently"
        }
    ]
}