{
    "name": "David Santana",
    "picture": "https://avatars.githubusercontent.com/u/110633725",
    "presentation": "Sou estudante de Sistemas de Informação e trabalho com programação há mais de um ano. Possuo um perfil proativo, focado em trazer inovação e organização ao ambiente de trabalho. Domino linguagens como Python, JavaScript e Java, com experiência sólida em MySQL, HTML, CSS e Bootstrap. Além disso, tenho familiaridade com C, C++ e Haskell.",
    "email": "davidsantana06@hotmail.com",
    "linkedin": "https://www.linkedin.com/in/david-santana-067278288/",
    "github": "https://github.com/davidsantana06",
    "formation": {
        "course": "Bacharelado em Sistemas de Informação",
        "learningCenter": "Instituto Federal de Educação, Ciência e Tecnologia da Bahia",
        "startDate": "05/2021",
        "endDate": "Atualmente"
    },
    "professionalExperiences": [
        {
            "position": "Monitor Acadêmico",
            "company": "Instituto Federal de Educação, Ciência e Tecnologia da Bahia",
            "responsibilities": "Minhas atividades envolviam instruir os discentes sobre conceitos importantes da linguagem de programação Java, tais como exceptions (Try/Catch), threads, generics, collections, I/O (Entrada/Saída) e JavaFX. Além disso, fui responsável por solucionar dúvidas específicas relacionadas à elaboração de atividades e trabalhos acadêmicos, bem como por auxiliar nas atividades avaliativas.",
            "startDate": "09/2022",
            "endDate": "12/2022"
        },
        {
            "position": "Desenvolvedor Web",
            "company": "Secretaria Municipal de Saúde de Vitória da Conquista",
            "responsibilities": "Minhas tarefas envolviam o desenvolvimento completo de aplicações web, incluindo análise de requisitos, coleta de dados, documentação, prototipagem, desenvolvimento de código e implantação da aplicação. Na construção das aplicações, eu utilizava principalmente as linguagens de programação Python com o framework Flask e JavaScript. Especificamente para o front-end, fazia uso do HTML, CSS, Bootstrap e bibliotecas JavaScript, como o AJAX.",
            "startDate": "02/2023",
            "endDate": "02/2024"
        }
    ]
}